Revit 2027 API
TableSectionData.IsCellOverridden(Int32) Method
 Indicates if the column is overridden or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCellOverridden(
	int nCol
)
Public Function IsCellOverridden (
	nCol As Integer
) As Boolean
public:
bool IsCellOverridden(
	int nCol
)
member IsCellOverridden :
        nCol : int -> bool
Parameters
nCol Int32
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
IsCellOverridden Overload
Autodesk.Revit.DB Namespace